package cources;

public class Start1 {
    public static void main(String[] args) {

        //boolean b = true; //логические переменные true/false
        //String str = "qwerty"; //строки, "" - литерал, строки записываются в "" ковычках
        char ch1 = 'Q'; //буквы записываются в '' одинарных ковычках
        char ch2 = 44; //буква это одновременно и её код,
        // по этому в char можно писать сразу и код буквы в виде числа

        byte b=5;
        short sh = 1234;
        int x = 547;
        long l = 123456789;

        float f = 0.3f; //для разделения целой и дробной части вещественного числа
        // используют точку. Поумолчанию вещественные числа имеют
        //тип данных double, по этому для указания на тип float используют f - в конце числа

        double d = 3.5; //значение от бесконечности до бесконечности



        //System.out.println(ch2);

    }
}
